current_week_homework_assignment_chris_murphy/w20d2/homework/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        tweet = Tweet.find(params[:id])
        replies = Tweet.find(params[:id]).reviews
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."tweet_id" = $1  [["tweet_id", 1]]

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test title"], ["content", "test content"], ["author", "Chris"], ["created_at", "2020-04-25 20:13:14.528163"], ["updated_at", "2020-04-25 20:13:14.528163"]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4  [["title", "Dentist 1"], ["content", "test content - My dentist's name is Crentist, maybe that's why he became a dentist"], ["updated_at", "2020-04-25 20:18:17.333796"], ["id", 101]]

    def destroy
        tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 101]]