current_week_homework_assignment_chris_murphy/w19d3/homework/matrix_app_api/app/controllers/characters_controller.rb

    def index
        characters = Character.all
---
SELECT "characters".* FROM "characters"

    def show
        character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]